In [1]:
%load_ext sql

In [2]:
# !pip install ipython-sql

In [3]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

In [4]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(None, datetime.datetime(2018, 11, 6, 2, 13, 3, 796000), 100, 'free', None, None, 248, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (None, datetime.datetime(2018, 11, 6, 2, 17, 12, 796000), 100, 'free', None, None, 248, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (None, datetime.datetime(2018, 11, 6, 3, 14, 8, 796000), 61, 'free', None, None, 252, 'Houston-The Woodlands-Sugar Land, TX', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"'),
 (None, datetime.datetime(2018, 11, 6, 4, 56, 11, 796000), 55, 'free', None, None, 250, 'Minneapolis-St. Paul-Bloomington, MN-WI', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (None, datetime.datetime(2018, 11, 6, 4, 56, 38, 796000), 55, 'free', None, None, 250, 'Minneapolis-St. Paul-Bloomington, MN-WI', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"')]

In [5]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('100', 'Adler', 'Barrera', 'M', 'free'),
 ('100', 'Adler', 'Barrera', 'M', 'free'),
 ('61', 'Samuel', 'Gonzalez', 'M', 'free'),
 ('55', 'Martin', 'Johnson', 'M', 'free'),
 ('55', 'Martin', 'Johnson', 'M', 'free')]

In [6]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOSWKAV12AB018FC91', 'Midnight Star', 'ARULZCI1241B9C8611', 0, 335.51628),
 ('SOSWKAV12AB018FC91', 'Midnight Star', 'ARULZCI1241B9C8611', 0, 335.51628),
 ('SOINLJW12A8C13314C', 'City Slickers', 'AR8IEZO1187B99055E', 2008, 149.86404),
 ('SONSKXP12A8C13A2C9', 'Native Soul', 'AR0IAWL1187B9A96D0', 2003, 197.19791),
 ('SODREIN12A58A7F2E5', 'A Whiter Shade Of Pale (Live @ Fillmore West)', 'ARLTWXK1187FB5A3F8', 0, 326.00771)]

In [7]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARULZCI1241B9C8611', 'Luna Orbit Project', '', None, None),
 ('ARULZCI1241B9C8611', 'Luna Orbit Project', '', None, None),
 ('AR8IEZO1187B99055E', 'Marc Shaiman', '', None, None),
 ('AR0IAWL1187B9A96D0', 'Danilo Perez', 'Panama', Decimal('8.417700'), Decimal('-80.112780')),
 ('ARLTWXK1187FB5A3F8', 'King Curtis', 'Fort Worth, TX', Decimal('32.748630'), Decimal('-97.329250'))]

In [8]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 6, 2, 13, 3, 796000), 2, 6, 1, 11, 2018, 45),
 (datetime.datetime(2018, 11, 6, 2, 17, 12, 796000), 2, 6, 1, 11, 2018, 45),
 (datetime.datetime(2018, 11, 6, 3, 14, 8, 796000), 3, 6, 1, 11, 2018, 45),
 (datetime.datetime(2018, 11, 6, 4, 56, 11, 796000), 4, 6, 1, 11, 2018, 45),
 (datetime.datetime(2018, 11, 6, 4, 56, 38, 796000), 4, 6, 1, 11, 2018, 45)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).